# Lab-Data-Manipulation - Group By and Joins

In [55]:
# setup from last exercise

import pandas as pd

ufo = pd.read_csv('/Users/user/1.IRONHACK/Ironhack Labs/Semana 2 dia 4/Dataframe-Aggregation/data/ufo.csv', sep = ';')
ufo
ufo_vars = ufo.loc[:, ['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']]
ufo_us = ufo_vars.loc[ufo_vars['country'] == 'us', :]

The second part of this lab consists of grouping and merging results to obtain valuable information.

# Grouping up the results.

## Let's calculate the average of the encounter for each country.

We should now group the results by the country column to see what is the mean encounter_seconds for each country. Do this using the `groupby` method of your dataframe `ufo_vars`. What is the average of the encounter for the us? And for Canada?

Remember that after grouping by a column, you have to specify a `aggregating function`. If you don't do that, the results of the groupby will only be a `groupby` pandas object. For this case, we want the aggregating function to be the `mean` function and then the results will appear for us.

Also remember that **if you don't** specify the `as_index=False` argument, the variables you use to group are going to become your new indexes.

Expected output:

>
>|    | country   |    year |   month |   encounter_seconds |
|---:|:----------|--------:|--------:|--------------------:|
|  0 | au        | 2002.69 | 6.12825 |             3806.47 |
|  1 | ca        | 2003.69 | 6.86167 |            28859.43 |
|  2 | de        | 2001.54 | 6.24762 |            24255.98 |
|  3 | gb        | 2003.65 | 6.5622  |            66061.32 |
|  4 | us        | 2004.09 | 6.8616  |             5800.19 |

In [2]:


ufo_vars.groupby(['country'], as_index=False).mean()

  country         year     month  encounter_length
0      au  2002.693309  6.128253       3806.469238
1      ca  2003.694333  6.861667      28859.437007
2      de  2001.542857  6.247619      24255.980952
3      gb  2003.648294  6.562205      66061.321207
4      us  2004.090057  6.861597       5800.192049

In [3]:
ufo_vars = ufo_vars.rename({'encounter_length': 'encounter_seconds'}, axis=1)
ufo_vars

       year  month state country ufo_shape  encounter_seconds
0      1949     10    tx      us  cylinder             2700.0
1      1949     10    tx     NaN     light             7200.0
2      1955     10   NaN      gb    circle               20.0
3      1956     10    tx      us    circle               20.0
4      1960     10    hi      us     light              900.0
...     ...    ...   ...     ...       ...                ...
80327  2013      9    tn      us     light              600.0
80328  2013      9    id      us    circle             1200.0
80329  2013      9    ca      us     other             1200.0
80330  2013      9    va      us    circle                5.0
80331  2013      9    ok      us     cigar             1020.0

[80332 rows x 6 columns]

## Perform the same task, but instead of calculating the mean, count how many occurrances for each country.

For this case, the aggregating function should be the `count` function. Try to understand the results for each column.

Expected output:

>
>|    | country   |   year |   month |   state |   ufo_shape |   encounter_seconds |
|---:|:----------|-------:|--------:|--------:|------------:|--------------------:|
|  0 | au        |    538 |     538 |      10 |         527 |                 538 |
|  1 | ca        |   3000 |    3000 |    2985 |        2955 |                3000 |
|  2 | de        |    105 |     105 |       0 |         103 |                 105 |
|  3 | gb        |   1905 |    1905 |      12 |        1855 |                1905 |
|  4 | us        |  65114 |   65114 |   65114 |       63561 |               65112 |

In [4]:
ufo_vars.groupby(['country'], as_index=False).count()

  country   year  month  state  ufo_shape  encounter_seconds
0      au    538    538     10        527                538
1      ca   3000   3000   2985       2955               3000
2      de    105    105      0        103                105
3      gb   1905   1905     12       1855               1905
4      us  65114  65114  65114      63561              65112

## Perform the same task, but instead of calculating the mean, use the `.describe()` aggregating function to see the effects.

The describe aggregating function will show you several important statistics for the grouped results, such as `mean`, `median`, `standard deviation`, `count`, `max`, `min`, and so on.

*Hint: If it starts to get difficult to see the results, you can tranpose the resulting dataframe by just putting a `.T` at the end.*

Expected output:

>
>|                   |   count |       mean |          std |      min |   25% |   50% |   75% |           max |
|:------------------|--------:|-----------:|-------------:|---------:|------:|------:|------:|--------------:|
| year              |   80332 | 2003.85    |     10.4268  | 1906     |  2001 |  2006 |  2011 | 2014          |
| month             |   80332 |    6.83491 |      3.23486 |    1     |     4 |     7 |     9 |   12          |
| encounter_seconds |   80329 | 9017.23    | 620228       |    0.001 |    30 |   180 |   600 |    97836000   |

In [5]:
print(ufo_vars.groupby(['country'], as_index=False).describe())

print(ufo_vars.groupby(['country'], as_index=False).count().T)

      year                                                                  \
     count         mean        std     min     25%     50%     75%     max
0    538.0  2002.693309   8.501768  1958.0  2001.0  2004.0  2007.0  2014.0
1   3000.0  2003.694333   9.382976  1936.0  2002.0  2005.0  2010.0  2014.0
2    105.0  2001.542857  12.411245  1962.0  2000.0  2006.0  2009.0  2014.0
3   1905.0  2003.648294   8.406754  1943.0  2002.0  2005.0  2009.0  2014.0
4  65114.0  2004.090057  10.385694  1910.0  2001.0  2007.0  2011.0  2014.0

     month            ...             encounter_seconds                \
     count      mean  ...   75%   max             count          mean
0    538.0  6.128253  ...   9.0  12.0             538.0   3806.469238
1   3000.0  6.861667  ...   9.0  12.0            3000.0  28859.437007
2    105.0  6.247619  ...   8.0  12.0             105.0  24255.980952
3   1905.0  6.562205  ...   9.0  12.0            1905.0  66061.321207
4  65114.0  6.861597  ...  10.0  12.0           65112.0   5800.192049


            std   min   25%    50%    75%         max
0  5.434101e+04  0.50  30.0  180.0  600.0   1209600.0
1  1.511732e+06  0.02  20.0  120.0  600.0  82800000.0
2  1.859988e+05  2.00  30.0  180.0  600.0   1814400.0
3  2.314714e+06  0.30  30.0  180.0  600.0  97836000.0
4  4.045197e+05  0.01  30.0  180.0  600.0  66276000.0

[5 rows x 24 columns]
                     0     1    2     3      4
country             au    ca   de    gb     us
year               538  3000  105  1905  65114
month              538  3000  105  1905  65114
state               10  2985    0    12  65114
ufo_shape          527  2955  103  1855  63561
encounter_seconds  538  3000  105  1905  65112

## Now, let's get deeper in the analysis and group the results not only by country. But by `country` and `year`

### Check the values of the mean and count for the `encounter_seconds` variable for each year. Can you see some discrepancy?

*Hint*: If you want, you can use the `ufo_us` dataset just to see the results for the united states. You could also (in a hacky way) perform the filter right before the groupby operation if you wanted.

In [48]:
ufo_vars.groupby(['year', 'country'], as_index=False).agg('encounter_seconds').mean()

     year country  encounter_seconds
0    1910      us         120.000000
1    1920      us          60.000000
2    1925      us          60.000000
3    1929      us          60.000000
4    1931      us         930.000000
..    ...     ...                ...
277  2014      au        2197.214286
278  2014      ca         789.377778
279  2014      de        3720.000000
280  2014      gb        8366.761905
281  2014      us         782.372979

[282 rows x 3 columns]

In [54]:
x=ufo_vars.groupby(['year', 'country'], as_index=False)
x.agg('encounter_seconds').mean()

     year country  encounter_seconds
0    1910      us         120.000000
1    1920      us          60.000000
2    1925      us          60.000000
3    1929      us          60.000000
4    1931      us         930.000000
..    ...     ...                ...
277  2014      au        2197.214286
278  2014      ca         789.377778
279  2014      de        3720.000000
280  2014      gb        8366.761905
281  2014      us         782.372979

[282 rows x 3 columns]

# BONUS 2: Which months are the ones with the highest numbers of occurrences?

**Example of output:**

>
>|   month |   occurrences |
|--------:|--------------:|
|       7 |          9520 |
|       8 |          8636 |
|       6 |          8152 |
|       9 |          7589 |
|      10 |          7407 |
|      11 |          6739 |
|       1 |          5689 |
|      12 |          5665 |
|       4 |          5527 |
|       3 |          5450 |
|       5 |          5293 |
|       2 |          4665 |

In [ ]:
#como limpar casas decimais
#pd.set_option('display.float_format','{:.3f}'.format)
#f=numero de casas decimais

# BONUS 3: Finally, you gathered information about the UFO dataset. Using your last result, try to bring that information for your original dataset.

1. Store the results of your previous analysis (the mean value for the encounter_seconds for each year and each country) in a dataframe called `avg_results`. 

Expected output:
>
>|     | country   |   year |   encounter_seconds |
|----:|:----------|-------:|--------------------:|
|   0 | au        |   1958 |      2700           |
|   1 | au        |   1960 |       180           |
|   2 | au        |   1967 |       300           |
|   3 | au        |   1968 |       300           |
|   4 | au        |   1972 |       403.333       | 
|   ... | ...        |   ... |       ...       | 
| 277 | us        |   2010 |      2271.99        |
| 278 | us        |   2011 |      2544.29        |
| 279 | us        |   2012 |     10640.6         |
| 280 | us        |   2013 |      1266.39        |
| 281 | us        |   2014 |       782.373       |

2. Rename the column named `encounter_seconds` to `avg_encounter_seconds`.

Expected output:
>
>|     | country   |   year |   avg_encounter_seconds |
|----:|:----------|-------:|--------------------:|
|   0 | au        |   1958 |      2700           |
|   1 | au        |   1960 |       180           |
|   2 | au        |   1967 |       300           |
|   3 | au        |   1968 |       300           |
|   4 | au        |   1972 |       403.333       | 
|   ... | ...        |   ... |       ...       | 
| 277 | us        |   2010 |      2271.99        |
| 278 | us        |   2011 |      2544.29        |
| 279 | us        |   2012 |     10640.6         |
| 280 | us        |   2013 |      1266.39        |
| 281 | us        |   2014 |       782.373       |

3. Use the pd.merge( ... ) function to bring that new collected information to your original dataset.
The pd.merge() function requires several arguments, let's understand the most important ones.

`left` is the dataframe you want to bring information **to** - the table on the left. 

`right` is the dataframe you want to bring information **from** - the table on the right. 

`on` is the key you want to perform the merge. That is, if those values are **exactly equal** in both dataframes, then the information will be brought.

Put your results on a dataframe called `merged_ufo`

Check how many rows the final result has and try to explain it. Did the dataset get smaller? Bigger? Or the same? Can you explain why? 

*hint: If you've found something weird, try looking back at your original dataframe and find something interesting on it.*

## Store the results into a new csv file called `ufo_enriched.csv`. 

Don't forget to use `index=False`.